; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v4)
             (pred_8 ?v13 ?v12)
             (pred_3 ?v8 ?v12)
             (pred_2 ?v2 ?v8 )
	     (pred_7 ?v8)
             (pred_12 ?v7)
             (pred_11 ?v13)
             (pred_5 ?v12)
             (pred_10 ?v8)
             (pred_4 ?v13)
             (pred_6 ?v8)
             (pred_9 ))



(:action op_4
:parameters (?v6 ?v1 ?v11 ?v3)
:precondition (and (pred_12 ?v6) (pred_12 ?v1) (pred_11 ?v11) (pred_5 ?v3)
          (pred_1 ?v6 ?v1) (pred_8 ?v11 ?v3)
                   (pred_3 ?v1 ?v3) (pred_7 ?v6) 
                   (pred_10 ?v1) (pred_4 ?v11))
:effect (and  (pred_6 ?v1) (not (pred_10 ?v1))))


(:action op_2
:parameters (?v6 ?v9)
:precondition (and (pred_12 ?v6) (pred_12 ?v9)
               (pred_7 ?v6) (pred_1 ?v6 ?v9) (pred_6 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v6))))

(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_11 ?v11) 
                  (pred_7 ?v6) (pred_2 ?v11 ?v6) (pred_9 ))
:effect (and (pred_4 ?v11)
   (not (pred_2 ?v11 ?v6)) (not (pred_9 ))))


(:action op_5
:parameters (?v6 ?v5 ?v10)
:precondition (and (pred_12 ?v6) (pred_11 ?v5) (pred_11 ?v10)
                  (pred_7 ?v6) (pred_4 ?v10) (pred_2 ?v5 ?v6))
:effect (and (pred_4 ?v5) (pred_2 ?v10 ?v6)
        (not (pred_4 ?v10)) (not (pred_2 ?v5 ?v6))))

(:action op_3
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_11 ?v11) 
                  (pred_7 ?v6) (pred_4 ?v11))
:effect (and (pred_9 ) (pred_2 ?v11 ?v6) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_07 obj_01 obj_13 obj_04 obj_22 obj_30 obj_02 obj_11 obj_32 obj_28 obj_18 obj_29 obj_09 obj_08 obj_06 obj_26 obj_23 obj_10 obj_24 obj_25 obj_15 obj_19 obj_21 obj_27
    obj_16 obj_05 obj_12
    obj_17 obj_31 obj_14 obj_20
    )

    (:init
       (pred_9)

       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_12 obj_30)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_32)
       (pred_12 obj_28)
       (pred_12 obj_18)
       (pred_12 obj_29)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_06)
       (pred_12 obj_26)
       (pred_12 obj_23)
       (pred_12 obj_10)
       (pred_12 obj_24)
       (pred_12 obj_25)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_12 obj_21)
       (pred_12 obj_27)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_11 obj_17)
       (pred_11 obj_31)
       (pred_11 obj_14)
       (pred_11 obj_20)

       (pred_1 obj_03 obj_22)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_07 obj_30)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_04 obj_32)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_22 obj_28)
       (pred_1 obj_22 obj_30)
       (pred_1 obj_22 obj_03)
       (pred_1 obj_30 obj_18)
       (pred_1 obj_30 obj_02)
       (pred_1 obj_30 obj_07)
       (pred_1 obj_30 obj_22)
       (pred_1 obj_02 obj_29)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_02 obj_30)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_32)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_32 obj_08)
       (pred_1 obj_32 obj_04)
       (pred_1 obj_32 obj_11)
       (pred_1 obj_28 obj_06)
       (pred_1 obj_28 obj_18)
       (pred_1 obj_28 obj_22)
       (pred_1 obj_18 obj_26)
       (pred_1 obj_18 obj_29)
       (pred_1 obj_18 obj_30)
       (pred_1 obj_18 obj_28)
       (pred_1 obj_29 obj_23)
       (pred_1 obj_29 obj_09)
       (pred_1 obj_29 obj_02)
       (pred_1 obj_29 obj_18)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_08 obj_24)
       (pred_1 obj_08 obj_32)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_06 obj_25)
       (pred_1 obj_06 obj_26)
       (pred_1 obj_06 obj_28)
       (pred_1 obj_26 obj_15)
       (pred_1 obj_26 obj_23)
       (pred_1 obj_26 obj_18)
       (pred_1 obj_26 obj_06)
       (pred_1 obj_23 obj_19)
       (pred_1 obj_23 obj_10)
       (pred_1 obj_23 obj_29)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_10 obj_21)
       (pred_1 obj_10 obj_24)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_23)
       (pred_1 obj_24 obj_27)
       (pred_1 obj_24 obj_08)
       (pred_1 obj_24 obj_10)
       (pred_1 obj_25 obj_15)
       (pred_1 obj_25 obj_06)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_15 obj_26)
       (pred_1 obj_15 obj_25)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_23)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_21 obj_27)
       (pred_1 obj_21 obj_10)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_27 obj_24)
       (pred_1 obj_27 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_3  obj_11 obj_16)
       (pred_3  obj_13 obj_05)
       (pred_3  obj_09 obj_12)
       (pred_3  obj_06 obj_05)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_22)
       (pred_6 obj_30)
       (pred_6 obj_02)
       (pred_6 obj_32)
       (pred_6 obj_28)
       (pred_6 obj_18)
       (pred_6 obj_29)
       (pred_6 obj_08)
       (pred_6 obj_26)
       (pred_6 obj_23)
       (pred_6 obj_10)
       (pred_6 obj_24)
       (pred_6 obj_25)
       (pred_6 obj_15)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_27)

       (pred_8  obj_17 obj_16)
       (pred_8  obj_31 obj_05)
       (pred_8  obj_14 obj_12)
       (pred_8  obj_20 obj_05)
       (pred_2 obj_17 obj_29)
       (pred_2 obj_31 obj_26)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_20 obj_19)
       (pred_7 obj_02)
    )

    (:goal (and
       (pred_2 obj_31 obj_25)
       (pred_2 obj_20 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_23)))
)
)

; plan
1. (op_2 obj_02 obj_29)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_29)
   goals met: 0 of 2
2. (op_2 obj_29 obj_18)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_18)
   goals met: 0 of 2
3. (op_2 obj_18 obj_26)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_26)
   goals met: 0 of 2
4. (op_2 obj_26 obj_15)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_15)
   goals met: 0 of 2
5. (op_2 obj_15 obj_19)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_19)
   goals met: 0 of 2
6. (op_1 obj_19 obj_20)
   deleted: (pred_2 obj_20 obj_19) (pred_9)
   added: (pred_4 obj_20)
   goals met: 0 of 2
7. (op_2 obj_19 obj_15)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_15)
   goals met: 0 of 2
8. (op_2 obj_15 obj_26)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_26)
   goals met: 0 of 2
9. (op_5 obj_26 obj_31 obj_20)
   deleted: (pred_4 obj_20) (pred_2 obj_31 obj_26)
   added: (pred_4 obj_31) (pred_2 obj_20 obj_26)
   goals met: 0 of 2
10. (op_2 obj_26 obj_15)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_15)
   goals met: 0 of 2
11. (op_2 obj_15 obj_25)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_25)
   goals met: 0 of 2
12. (op_3 obj_25 obj_31)
   deleted: (pred_4 obj_31)
   added: (pred_9) (pred_2 obj_31 obj_25)
   goals met: 1 of 2
13. (op_2 obj_25 obj_15)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_15)
   goals met: 1 of 2
14. (op_2 obj_15 obj_26)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_26)
   goals met: 1 of 2
15. (op_1 obj_26 obj_20)
   deleted: (pred_2 obj_20 obj_26) (pred_9)
   added: (pred_4 obj_20)
   goals met: 1 of 2
16. (op_2 obj_26 obj_15)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_15)
   goals met: 1 of 2
17. (op_2 obj_15 obj_19)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_19)
   goals met: 1 of 2
18. (op_2 obj_19 obj_21)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_21)
   goals met: 1 of 2
19. (op_2 obj_21 obj_10)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_10)
   goals met: 1 of 2
20. (op_3 obj_10 obj_20)
   deleted: (pred_4 obj_20)
   added: (pred_9) (pred_2 obj_20 obj_10)
   goals met: 2 of 2
